import { it } from '@fast-check/vitest';
import { describe, expect } from 'vitest';

import { solveUnlined } from './code';

describe.only('H. Большое число', () => {
    it('Проходит фиксированный тест №1', () => {
        const input = `3
15 56 2
`;
        const res = solveUnlined(input);

        expect(res[0]).toEqual('56215');
    });

    it('Проходит фиксированный тест №2', () => {
        const input = `3
1 783 2
`;
        const res = solveUnlined(input);

        expect(res[0]).toEqual('78321');
    });

    it('Проходит фиксированный тест №3', () => {
        const input = `5
2 4 5 2 10
`;
        const res = solveUnlined(input);

        expect(res[0]).toEqual('542210');
    });

    it('Проходит фиксированный тест №4', () => {
        const input = `6
9 10 1 1 1 6
`;
        const res = solveUnlined(input);

        expect(res[0]).toEqual('9611110');
    });

    it('Проходит фиксированный тест №5', () => {
        const input = `38
82 58 66 34 64 37 40 97 93 52 28 98 90 64 19 22 21 83 56 70 46 17 31 51 55 41 68 18 98 89 88 74 6 6 31 36 35 8
`;
        const res = solveUnlined(input);

        expect(res[0]).toEqual(
            '9898979390898888382747068666664645856555251464140373635343131282221191817',
        );
    });

    it('Проходит фиксированный тест №6', () => {
        const input = `100
260 1000 838 428 571 1000 751 22 820 738 909 304 453 292 456 1000 222 611 997 606 211 681 446 295 307 633 855 551 36 641 920 1000 119 1000 47 891 113 715 235 797 196 120 1000 587 57 44 597 614 205 636 1000 442 469 571 745 887 941 674 501 471 177 146 167 374 677 334 692 32 514 135 328 462 986 170 1000 792 851 856 987 413 980 39 984 1000 1000 703 602 334 945 134 169 871 145 522 657 181 700 845 562 148
`;
        const res = solveUnlined(input);

        expect(res[0]).toEqual(
            '997987986984980945941920909891887871856855851845838820797792751745738715703700692681677674657641636633614611606602597587575715715625515225145014747146946245645344644442428413393743633433432832307304295292260235222222112051961811771701691671481461451351341201191131000100010001000100010001000100010001000',
        );
    });
});
